[
    {
        "title": "MOXIE Could Help Future Rockets Launch Off Mars",
        "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."
    },
    {
        "title": "NASA's Mars Perseverance Rover Gets Its Sample Handling System",
        "preview": "The system will be collecting and storing Martian rock and soil. Its installation marks another milestone in the march toward the July launch period."
    },
    {
        "title": "Mars 2020 Stands on Its Own Six Wheels",
        "preview": "In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels."
    },
    {
        "title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities",
        "preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."
    },
    {
        "title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus",
        "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."
    },
    {
        "title": "Media Get a Close-Up of NASA's Mars 2020 Rover",
        "preview": "The clean room at NASA's Jet Propulsion Laboratory was open to the media to see NASA's next Mars explorer before it leaves for Florida in preparation for a summertime launch."
    },
    {
        "title": "NASA's New Mars Rover Is Ready for Space Lasers",
        "preview": "Perseverance is one of a few Mars spacecraft carrying laser retroreflectors. The devices could provide new science and safer Mars landings in the future."
    },
    {
        "title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface",
        "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."
    },
    {
        "title": "NASA's Curiosity Rover Finds an Ancient Oasis on Mars",
        "preview": "New evidence suggests salty, shallow ponds once dotted a Martian crater — a sign of the planet's drying climate."
    },
    {
        "title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest",
        "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "
    },
    {
        "title": "The Detective Aboard NASA's Perseverance Rover",
        "preview": "An instrument called SHERLOC will, with the help of its partner WATSON, hunt for signs of ancient life by detecting organic molecules and minerals."
    },
    {
        "title": "Two of a Space Kind: Apollo 12 and Mars 2020",
        "preview": "Apollo 12 and the upcoming Mars 2020 mission may be separated by half a century, but they share several goals unique in the annals of space exploration."
    },
    {
        "title": "Mars Helicopter Attached to NASA's Perseverance Rover",
        "preview": "The team also fueled the rover's sky crane to get ready for this summer's history-making launch."
    },
    {
        "title": "Follow NASA's Perseverance Rover in Real Time on Its Way to Mars",
        "preview": "A crisply rendered web application can show you where the agency's Mars 2020 mission is right now as it makes its way to the Red Planet for a Feb. 18, 2021, landing."
    },
    {
        "title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'",
        "preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."
    }
]